create_clock -name "clk" -period 60 -waveform {0 30} [get_ports clk]
set_clock_uncertainty 0.2 [get_clock clk]
set_false_path -from [get_port rst_n]
set_clock_uncertainty -setup 0.65 [get_clocks clk]
set_clock_uncertainty -hold 0.45 [get_clocks clk]
